app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["price", 3], ["created_at", "2017-12-15 15:31:03.741007"], ["updated_at", "2017-12-15 15:31:03.741007"], ["inventory", 12], ["description", "This is a great thing"]]
---
  def create
    Product.create(product_params)